# Gözlem ve Değişken Seçimi(loc &iloc )

In [2]:
import pandas as pd 
import numpy as np

In [3]:
m=np.random.randint(1,30,size=(10,3))

In [4]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    24    16     1
1    21    23     3
2    23    14    23
3    26    14    23
4     7    22     3
5     4    15    20
6    22     9    13
7     8    19    21
8     5    17    16
9    17     6    19

# Loc :  ** Tanimlandığı şekliyle seçim yapmak için kullanılır. **

In [5]:
df.loc[0:3]

   var1  var2  var3
0    24    16     1
1    21    23     3
2    23    14    23
3    26    14    23

# İloc: ** Alışık olduğumuz indeksleme mantığı ile seçim yapar.**

In [6]:
df.iloc[0:3]

   var1  var2  var3
0    24    16     1
1    21    23     3
2    23    14    23

In [7]:
df.iloc[0,0]

24

In [8]:
df.iloc[:3,:2]

   var1  var2
0    24    16
1    21    23
2    23    14

In [9]:
df.loc[:,"var3"]

0     1
1     3
2    23
3    23
4     3
5    20
6    13
7    21
8    16
9    19
Name: var3, dtype: int32

In [10]:
df.loc[0:3,"var3"]

0     1
1     3
2    23
3    23
Name: var3, dtype: int32

In [11]:
df.iloc[0:3,1:3]

   var2  var3
0    16     1
1    23     3
2    14    23

In [12]:
df.iloc[0:3]["var3"]

0     1
1     3
2    23
Name: var3, dtype: int32

In [13]:
df["var1"]

0    24
1    21
2    23
3    26
4     7
5     4
6    22
7     8
8     5
9    17
Name: var1, dtype: int32

In [16]:
df[0:2] [["var1","var2"]]

   var1  var2
0    24    16
1    21    23

In [18]:
df[df.var1 > 15 ]

   var1  var2  var3
0    24    16     1
1    21    23     3
2    23    14    23
3    26    14    23
6    22     9    13
9    17     6    19

In [19]:
df[df.var1 > 15 ]["var1"]

0    24
1    21
2    23
3    26
6    22
9    17
Name: var1, dtype: int32

In [21]:
df[((df.var1>15) & (df.var3<5))]

   var1  var2  var3
0    24    16     1
1    21    23     3

In [24]:
df.loc[df.var1>15,["var1","var2"]]

   var1  var2
0    24    16
1    21    23
2    23    14
3    26    14
6    22     9
9    17     6

In [25]:
df[df.var1>15][["var1","var2"]]

   var1  var2
0    24    16
1    21    23
2    23    14
3    26    14
6    22     9
9    17     6